var Map;
var myPlacemark;
var myMap;

function initShip(coords, address, address2) {

    Map = new ymaps.Map("map", {
        center: coords,
        controls: ['typeSelector', 'fullscreenControl'],
        zoom: 10
    });
    cityGeocode(address, 0);
    cityGeocode(address2, 1);
    
}

function addPlacemark(coords, count, address) {
    myPlacemark = new ymaps.Placemark(coords, {
        hintContent: address,
        balloonContent: '<p>' + address + '</p>'
    }, {
        // Опции.
        // Необходимо указать данный тип макета.
        iconLayout: 'default#image',
        // Своё изображение иконки метки.
        iconImageHref: '/assets/template/images/elements/map-icon-' + count + '.svg',
        // Размеры метки.
        iconImageSize: [25, 33],
        // Смещение левого верхнего угла иконки относительно
        // её "ножки" (точки привязки).
        iconImageOffset: [-12, -33]
    });

    Map.geoObjects.add(myPlacemark);
    
}

function cityGeocode(address, count) {
    ymaps.geocode(address, { //геокодирование адреса
        results: 1
    }).then(function (res) {
        // Выбираем первый результат геокодирования.
        var firstGeoObject = res.geoObjects.get(0);
        // Координаты геообъекта.
        var coords = firstGeoObject.geometry.getCoordinates();
        //routeCreate(coords); // вызов функции построения маршрута
        addPlacemark(coords, count, address);
    });    
}


function init_shipmap() {
    myMap = new ymaps.Map("shipping_map", {
        center: [30.323988999999944,59.876228064261454],
        zoom: 8,
        controls: ['typeSelector', 'fullscreenControl']
    });

    // Создаем многоугольник, используя вспомогательный класс Polygon.
    var myPolygon = new ymaps.Polygon([
            // Указываем координаты вершин многоугольника.
				[[30.3779,60.0549],[30.381,60.055],[30.4126,60.0495],[30.4338,60.0433],[30.4383,60.038],[30.4515,60.0235],[30.4582,60.0181],[30.4737,60.0109],[30.4757,59.9991],[30.4818,59.9902],[30.486,59.988],[30.4889,59.9863],[30.5006,59.9827],[30.5229,59.9799],[30.5344,59.975],[30.5277,59.973],[30.5035,59.9691],[30.4891,59.9615],[30.5069,59.9461],[30.5208,59.9456],[30.5203,59.9318],[30.5169,59.9218],[30.5218,59.9156],[30.523,59.9055],[30.5208,59.8921],[30.5284,59.8719],[30.5155,59.8601],[30.4945,59.8548],[30.4746,59.8528],[30.4592,59.8477],[30.4414,59.8327],[30.4309,59.8259],[30.3827,59.8172],[30.37,59.817],[30.3392,59.8168],[30.3245,59.8112],[30.3238,59.8032],[30.3138,59.8038],[30.307,59.8064],[30.2876,59.8104],[30.2819,59.8117],[30.2836,59.8192],[30.3064,59.8193],[30.2882,59.8297],[30.2784,59.8348],[30.2653,59.8349],[30.2434,59.8297],[30.2233,59.8241],[30.1843,59.8238],[30.1445,59.8256],[30.1393,59.8261],[30.1392,59.8352],[30.1275,59.8353],[30.1302,59.8415],[30.1309,59.8473],[30.1339,59.8483],[30.1405,59.8547],[30.1411,59.8578],[30.1405,59.862],[30.1481,59.8634],[30.1529,59.8688],[30.1694,59.8683],[30.1752,59.8688],[30.2102,59.8624],[30.2353,59.8645],[30.2456,59.8736],[30.2556,59.8886],[30.238,59.8971],[30.2473,59.9088],[30.2593,59.9154],[30.2378,59.9252],[30.2276,59.9288],[30.211,59.9366],[30.2052,59.9447],[30.2112,59.9561],[30.2143,59.9589],[30.2172,59.9698],[30.2143,59.9739],[30.2173,59.977],[30.2273,59.9817],[30.2137,59.9818],[30.2098,59.9799],[30.2074,59.98],[30.2077,59.9836],[30.1928,59.9855],[30.1892,59.9904],[30.1928,59.9934],[30.1952,60.0027],[30.2009,60.0081],[30.2051,60.0112],[30.2256,60.0093],[30.2332,60.0132],[30.2216,60.0224],[30.2088,60.0276],[30.2118,60.0285],[30.2172,60.0297],[30.2228,60.0329],[30.2213,60.0352],[30.2184,60.0421],[30.2267,60.0432],[30.2345,60.0382],[30.2361,60.0369],[30.2429,60.0389],[30.246,60.0368],[30.2531,60.0419],[30.2595,60.0412],[30.2616,60.0354],[30.2755,60.0364],[30.2768,60.0462],[30.281,60.0488],[30.2903,60.0504],[30.3079,60.0535],[30.303,60.0598],[30.2977,60.0656],[30.3043,60.0671],[30.3117,60.0668],[30.3179,60.0656],[30.3271,60.0636],[30.3357,60.0619],[30.3452,60.0601],[30.3538,60.0585],[30.3679,60.0555],[30.3779,60.0549]]
        ],
        // Описываем свойства геообъекта.
        {
            // Содержимое балуна.
            hintContent: '<p>Зона 1</p>',
            balloonContent: '<p>Зона 1</p>'
        }, {
            // Описываем опции геообъекта.
            // Фоновое изображение.
            // Убираем видимость обводки.
            stroke: false,
            fillColor: '#ff005d33'
        }
    );
    var myPolygon2 = new ymaps.Polygon([
            // Указываем координаты вершин многоугольника.
            [[29.0447,59.8512],[29.1353,59.8885],[29.3056,59.8899],[29.355,59.9437],[29.5363,59.9313],[29.4979,59.818],[29.5418,59.753],[29.5556,59.7294],[29.3331,59.7627],[29.3111,59.7391],[29.3962,59.7086],[29.4677,59.6989],[29.5693,59.7003],[29.594,59.66],[29.4539,59.6252],[29.4484,59.596],[29.4594,59.5751],[29.4429,59.543],[29.6489,59.3893],[29.9538,59.3332],[30.1845,59.3753],[30.5251,59.4061],[30.7174,59.4089],[30.8739,59.4509],[31.2859,59.3248],[31.3189,59.4481],[31.2941,59.596],[31.3298,59.6669],[31.3243,59.703],[31.2667,59.7502],[31.4864,59.8139],[31.5413,59.8609],[31.5139,59.9133],[31.4122,59.8954],[31.3436,59.9051],[31.2694,59.923],[31.1843,59.9078],[31.1293,59.9244],[31.0552,59.9409],[31.0175,59.9549],[31.0889,59.9921],[31.0477,60.069],[30.9653,60.1568],[30.9104,60.2579],[30.8573,60.3202],[30.72,60.3243],[30.5085,60.376],[30.5524,60.4968],[30.5634,60.5861],[30.4402,60.5846],[30.2919,60.5846],[30.2122,60.6183],[30.171,60.6709],[30.0611,60.6723],[29.9733,60.6763],[29.8963,60.6399],[29.7316,60.6413],[29.5695,60.6332],[29.4459,60.6075],[29.3498,60.6089],[29.1987,60.6156],[29.1776,60.5697],[29.282,60.4736],[29.0815,60.4695],[29.0375,60.4587],[29.0183,60.4329],[28.9579,60.3772],[28.9469,60.3105],[28.9524,60.26],[28.9716,60.2273],[28.9908,59.9088],[29.0447,59.8512]]
        ],
        // Описываем свойства геообъекта.
        {
            // Содержимое балуна.
            hintContent: '<p>Зона 2</p>',
            balloonContent: '<p>Зона 2</p>'
        }, {
            // Описываем опции геообъекта.
            // Фоновое изображение.
            // Убираем видимость обводки.
            stroke: false,
            fillColor: '#19c10a33'
        }
    );


    // Добавляем многоугольник на карту.
	myMap.geoObjects.add(myPolygon2);
    myMap.geoObjects.add(myPolygon);
}

if (typeof ymaps != 'undefined') {
    var adrs =  $('.contacs_address');
    ymaps.ready(function() {
        if ($('#map').length) {
            initShip([59.91502533444242,30.29787776978886], adrs.first().data('address'), adrs.last().data('address'));
        }
        else if ($('#shipping_map').length) {
            init_shipmap();
        }
    });
}
